<?php

use Illuminate\Database\Seeder;
use App\Introduction;

class IntroductionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // Hristo Botev Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 1;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Христо Ботев е български поет, който твори през 60-те и 70-те години на XIX век. Творчеството му излиза от тесните рамки на фолклорното мислене, авторът достига философски прозрения за вечните въпроси вълнуващи човека - борбата, смъртта, свободата. Смъртта и свободата са равнопоставени в литературата на поета. Той изравнява нивото на българската литература с това на европейската. Както творчеството, така и живота на революционера е подчинен на голямата идея за борбата, героичната смърт и свободата. В Ботевите произведения се открояват традициите и неговото новаторство. Той изразява своите позиции чрез лирическият си герой.';
        $introduction->save();

        // Ivan Vazov Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 2;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Иван Вазов е патриарх на българската литература и духовен водач на българския народ. Творчеството на Вазов е отражение на две исторически епохи – Възраждането и следосвобожденска България. Той представя сблъсъкът между двете – между минало и настояще.  В предосвобожденската се отличава със своите възвишени възрожденски идеали, а в следосвобожденска с меркантилността и деградацията на ценностната система. Творчеството му е голямо по размер и още по-голямо по значение. Вазов превръща поезията в своя съдба и заслужено е обявен за народен поет. Основните принципи в творчеството му са хуманизъм, демократизъм и патриотизъм. Той разглежда темата за България в различни аспекти, като родното е свръхценност във всяко едно негово произведение.';
        $introduction->save();

        // Aleko Konstantinov Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 3;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Алеко Константинов наричан още „будната съвест на своето време“ твори през 90-те години на XIX век. Това време събужда много обществени промени, борби и огромни разочарования на ценностен хаос. Алековото творчество изобличава обществения морал и нравствената деградация на личността в следосвобожденска България. Интерпретира обществени промени и използва всички форми на комичното. Той нарича себе си „Щастливеца“, този псевдоним е дръзко  предизвикателство  към действителността, в която живее, защото моралните ценности и идеали нямат стойност, а Алеко е чист пред обществената си съвест. Той притежава извисена духовна същност  и чисти идеали. Съвестта е критерии за живота и творчеството му. Людмил Стоянов го нарича „съвест, която боде“. Алеко е изпреварил своето време с прозренията си за общество и личност. Неговото творчество е актуално и днес, защото в него присъстват принципите на демократизма, хуманизма и идеализма. Героите на Алеко са негови антиподи…';
        $introduction->save();

        // Pencho Slaveikov Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 4;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Пенчо Славейков твори през последното десетилетие на XIX век и началото на XX век. Епохата, през която твори се характеризира с нови виждания за литературата, със стремеж за нейното европеизиране. Погледът на твореца е насочен към вселената на човешката душа. Източник и генератор на модерния литературен живот става кръгът ,,Мисъл”, който очертава концепция за творчеството и твореца. Идеалът на Славейков е гордата и независима личност, ,,със свой разум и със своя воля”. Той насочва вниманието към вътрешния свят на човека, утвърждава идеята за превъзмогване на човешкото страдание като обвързва фолклорната традиция с модерното. Известният български поет Димчо Дебелянов нарича Пенчо Славейков ,,жрецът –воин в Българската литература”. Определението ,,жрецът-воин „ се интерпретира като посветеният, избраният, медиаторът между материалното и духовното. Думата ,,воин” насочва към стремежа на Славейков за европеизиране на Българската литература. Една от основните теми в творчеството му  е за страданието, извисяващо човека.';
        $introduction->save();

        // Peio Qvorov Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 5;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Пейо Яворов живее и твори в началото на XX век. Поезията му заема средищно място между индивидуализма и символизма. Драматизмът е емблемата на неговия поетически свят. Яворов е предвестник на българския символизъм с творбата си ,,Песен на песента ми”. Интерпретира темата за страданието, но за разлика от Пенчо Славейков се отнася скептично към способността на човека да преодолява страданието и вътрешното си раздвоение. Лирическият герои на Яворов е личност на крайните психологически състояния на неспокойната и вечно търсеща душа. Той е герой на драматизма, на трагизма и на страданието. Лирическият му герой е склонен към драматично търсене, а не към щастливо откриване.';
        $introduction->save();

        // Elin Pelin Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 6;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Елин Пелин живее и твори между двете световни войни. Това е време, което се характеризира със съществени промени както в обществото, така и в литературното пространство. В неговото творчество се интерпретират теми, проблеми и мотиви за духовното битие на българина. Елин Пелин е наричан „певец  на българското село“, но творчеството му отразява и „пъстрия, многообразен и противоречив живот“. Елин-Пелиновите текстове отразяват не само живота на българското село, а и цялата българска действителност в началото на XXвек. Време, в което традиционните патриархални ценности са поставени на изпитание. Гледната точка на Елин Пелин е тази на обикновения българин. Неговото творчество е екзистенциално по своята насоченост и жизнелюбиво по своята същност. Той изследва социални и нравствени конфликти между човека и държавата, човека и природата, града и селото, доброто и злото, но разгледани като единство.';
        $introduction->save();

        // Dimcho Debelqnov Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 7;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Присъствието на Дебелянов в българската литература е свързано с началото на XX. век, когато в страната започва да се развива символизмът, като едно от проявленията на българския модернизъм. Повечето от лирическите текстове на Дебелянов са представителни за българския символизъм.  Текстовете му имат връзка със символичната поезия, но в нея липсват типичните за Символизма абстрактност и отвлеченост. Димчо Дебелянов принадлежи към поколението на символистите, но не и към тяхната школа. В неговата поезия се откриват и романтични и реалистични внушения. Творчеството на Дебелянов е близко до това на Пенчо Славейков и Яворов. От Славейков той усвоява търсенето на вътрешната глъбина и хармония. Яворов му въздейства с дълбоката си конфликтност, с противоречивостта си. Счита се, че Яворовите ,,две души” при Дебелянов са във вариант ,,разнолика, нестройна душа”. В творбите му се открояват универсални конфликти и мотиви, търсят се истини за същността на човека и битието. Основният тон в поетическият свят на Дебелянов е елегизмът. Лириката на Дебелянов е белязана от знаците на тъгата, самотата, раздвоението, лутането, безпътицата, от усещането за несполучили радости и неизживян живот. Ключови понятия в неговата поезия са блян, спомен, мечта, копнеж, идеал, безприютност, самота, бездомност и др. . Лирическият герой на Дебелянов е неспокойна, раздвоена, противоречива личност - ,,разнолика, нестройна душа” , при която е налице разминаване между идеал и действителност, което поражда спотаен драматизъм и овладян трагизъм в душата му. Той е ,,печален странник”, който не намира покой, който търси хармония със себе си и със света. Лирическият човек се определя като трагично изживяващ битието. Неговото пространство е нощта, в която търси утеха и покой. Разочарован от действителността, копнее за хармоничното пространство на спомена и бляна, за света на миналото, в който родният дом и майката са основни духовни опори.';
        $introduction->save();

        // Hristo Smirnenski Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 8;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Христо Смирненски е псевдоним на Христо Димитров Измирлиев, наричан е още ,,слънчевото дете на българската поезия”. Той е ярко явление на българския постсимволизъм. Лириката му от 20-те години на ХХ век се ситуира на границата на две културни епохи – символизма и авангардизма. Използва богатата символика на символистите, тяхната образност, но съдържанието, което влага в поетическите си текстове е различно – реабилитира веществения сват. Смирненски създава поезия със символистични образи на града, улицата, децата, тълпата, революцията. Централен символ в поезията му е светлината. Той за първи път възпява улицата в българската литература, като арена на бунта. Градът в поезията на Смирненски е многозначен и динамичен. Той е място на контрастите, защото в него се срещат светлината и мракът, бедността и богатството, животът и смъртта. Но градът е и арената на бъдещия бунт, на революционната трансформация. Обектът на изображение в творчеството му е съдбата на унизените и оскърбените,които са невинна жертва на действителността. Революцията при него е единствената алтернатива за постигане на справедливостта. Тя е границата между Апокалипсиса и Сътворението, между разрушителното и съзидателното. Творчеството на Смирненски е визия не естествения човешки стремеж към по-добър живот.На основата на левите си убеждения, Смирненски гради своя художествен мит за революцията, която преобразява света и възцарява справедливостта. Лирическият човек на Смирненски е обобщен образ на унизените и оскърбените, на човека водач. Той е връзката, медиаторът между света на тълпите и мечтания свят. Човекът е готов да се саможертва.';
        $introduction->save();

        // Geo Milev Introductions
        $introduction = new Introduction();
        $introduction->author_id = 9;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Гео Милев е многостранна творческа личност, която ярко присъства в българския културен живот през 20-те години на миналия век. Той търси нови естетически птища, чертае  модерни посоки на духовното развитие и приобщава към голямото европейско изкувство. Гео Милев преобръща традициите и забързва българския културен процес. Със своето ново естетическо мислене той оформя третия кръг на родния модернизъм – авангардизмът. След индивидуализмът и символизмът, Гео-Милевият авангардизъм се превръща в поредното отласкване на литературата ни от реализма в трескаво търсене на нови естетически ценности. Той провокира общоприетия естетически вкус, шокира традиционното литературно съзнание. Творбите му носят отпечатъка на ново мислене, дистанциращо се от познатото и изчерпаното в света на изкувството.';
        $introduction->save();

        // Atanas Dalchev Introductions
        $introduction = new Introduction();
        $introduction->author_id = 10;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Атанас Далчев твори през 20-те години на ХХ век. Лириката му се е родила в лоното на символизма. Поетът влиза в литературата на 20-те години със свой специфичен поетически свят. В художественото си изграждане и в посланията на стиховете му се съхранява ,,спомена” за символизма. Това творчество акцентира върху баналното, грозното и отблъскващото, прави поезия от света на вещите.Чрез предметите той се опитва да прозре смисъла – или поточно безсмислието на човешката екзистенция. При поета материалният свят на вещите има и втори план – той отвежда към смета на идеите. В такъв смисъл Далчевите предмети са символи. Те маркират кунтурите на един философски размисъл за веремето / смъртта/ съществуването/ драмата на човешката обреченост/ отчуждението/ самотата и страданието на индивида/ напразното търсене на своята идентичност.';
        $introduction->save();

        // Elisaveta Bagrqna Introductions

        // Iordan Iovkov Introductions
        $introduction = new Introduction();
        $introduction->author_id = 12;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Йордан Йовков твори през 20-те години на ХХ век. Писателят преживява културните, социалните и политическите трусове на три войни и така те предопределят персонажите и творчеството на писателя. В творчеството си писателят търси и разкрива сложната и противоречива душевност на  копнеещ за красив и нравствен свят. Силата на Йовковия хуманизъм не е в социалната му ангажираност, а в категоричната му етичност. В своите творби писателят изследва диалектиката на красотата. Тя е сила, която гради и разрушава, заражда и погубва, дарява щастие, но носи и скръб. Йордан Йовков е останал в спомените на съвременниците си като личност с подчертано консервативна нагласа, с изостанало чувство за порядък и хармония, склонен към съзерцателност и самовглъбяване. Той е писател, които превръща творчеството си в проникновен размисъл за вечните и преходните стойности в живота, за незаменимото и временното у човека и неговия свят, за ,,това, което отминава” и ,,това, което остава” в екзистенциалния кръговрат.';
        $introduction->save();

        // Nikola Vapcarov Introductions
        $introduction = new Introduction();
        $introduction->author_id = 13;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Никола Вапцаров е поет, който се утвърждава в епохата на 30-те и началото на 40-те години на миналия век. Това  е време на множество драматични събития, разтърсващи света. Време, което променя човека и го изравя пред важен избор. Време търсещо облика на Историята. Съвместявайки разнообразни, а често и противоречиви образи на света и човека, Вапцаровата поетическа вселена се основава на естетиката на контрастите. Емблематична характеристика на Вапцаровата поезия е и нейната диалогичност. Словото в нея е ориентирано към събеседник. Неговата диалогичност е и емоционална, и интимо-доверителна, и остро полемична. Така Вапцаровата поезия успява да разкаже ,,със думи прости”  за ,,простата човешка драма”.';
        $introduction->save();

        // Dimitar Dimov Introductions

        // D.J.K.
        $introduction = new Introduction();
        $introduction->author_id = 14;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Димитър Димов е писателят, който се утвърждава през 50-те години на XX век. В този период тоталитарната литературна критика налага естетиката на социалистическия реализъм. Димов е писател с подчертани демократични позиции и се смята за майстор на психологическия и социалния роман. С творчеството си утвърждава в българската литература модерен художествен стил, който се отличава с психологическо проникновение, интелектуална задълбоченност, остра конфликтност и тънък усет към богатсвото на езика. С творчеството си авторът търси сложни и необичайни психологически конфликти, болезнени и свръхчувствителни отношения между персонажите.';
        $introduction->save();

        // Dimitar Talev Introductions
        $introduction = new Introduction();
        $introduction->author_id = 15;
        $introduction->source = 'Д.Ж.А.';
        $introduction->content = 'Времето, в което живее и твори Димитър Талев, е белязано от редица обществени, политически и социални трусове. Това е времето между двете световни войни. Историческата тема е водеща в творчеството на Димитър Талев. В миналото, в българската история писателят изследва формирането на историческото битие на народа ни. В творбите си Талев разработва теми за миналото, защото е убеден, че в него се намират ,,корените на съвременността”.';
        $introduction->save();

    }
}
